3D_riblet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 #includeIfPresent "../parameters.dat"


convertToMeters 1e-6;

//N of riblets
//d = 92 : 4
//d = 46 : 6
//d = 23 : 9
//
// ribletX_nC $d_92_params.ribletX_nC; //the no. of x-cells in the blocks on/above the riblets
// plateauX_nC $d_92_params.plateauX_nC; //the no. of x-cells in the blocks on/above the space between riblets
//
// surfaceY_nC $d_92_params.surfaceY_nC; //the no. of y-cells in the blocks on the surface
// fluidY_nC $d_92_params.fluidY_nC; //the n0. of y-cells in the blocks in the surrounding fluid (e.g. ocean)
//
// ribletX_nC $d_46_params.ribletX_nC; //the no. of x-cells in the blocks on/above the riblets
// plateauX_nC $d_46_params.plateauX_nC; //the no. of x-cells in the blocks on/above the space between riblets
//
// surfaceY_nC $d_46_params.surfaceY_nC; //the no. of y-cells in the blocks on the surface
// fluidY_nC $d_46_params.fluidY_nC; //the n0. of y-cells in the blocks in the surrounding fluid (e.g. ocean)
// //

ribletX_nC 8; //the no. of x-cells in the blocks on/above the riblets
plateauX_nC 4; //the no. of x-cells in the blocks on/above the space between riblets

surfaceY_nC 6; //the no. of y-cells in the blocks on the surface
fluidY_nC 18; //the n0. of y-cells in the blocks in the surrounding fluid (e.g. ocean)

systemZ_nC 75; //no. of z-cells throughout the system
z_grading 1; //z-cells grading throughout the system. uniform for now

LBlockX_nC 8; //no. of x-cells in the LHS blocks
RBlockX_nC 8; //no. of x-cells in the RHS blocks

//these are old values, they were too fine for dynmaic meshing.
//we'll start with an initially coarser mesh so that mesh refinement is a bit more valid
// ribletX_nC 15; //the no. of x-cells in the blocks on/above the riblets
// plateauX_nC 6; //the no. of x-cells in the blocks on/above the space between riblets
//
// surfaceY_nC 14; //the no. of y-cells in the blocks on the surface
// fluidY_nC 26; //the n0. of y-cells in the blocks in the surrounding fluid (e.g. ocean)
//
// systemZ_nC 120; //no. of z-cells throughout the system
// z_grading 1; //z-cells grading throughout the system. uniform for now
//
// LBlockX_nC 12; //no. of x-cells in the LHS blocks
// RBlockX_nC 12; //no. of x-cells in the RHS blocks

r_grading_x 1.4; //grading of the x-mesh on the RHS of the riblet
l_grading_x #calc "1./$r_grading_x";

t_grading_y 3; //grading of the y-mesh on the top blocks (fluid regime)
b_grading_y #calc "1./2."; //grading of the y-mesh on the blocks in the riblet channels

outlet_xGrading 0.8; //x-grading of the RHS x-cells
inlet_xGrading #calc "1./$outlet_xGrading"; //x-grading of the inlet x-cells



vertices
(
	(0.000  0.000  0.000)	 //vertex 0
	(18.400  0.000  0.000)	 //vertex 1
	(46.000  0.000  0.000)	 //vertex 2
	(78.245  0.000  0.000)	 //vertex 3
	(105.845  0.000  0.000)	 //vertex 4
	(124.245  0.000  0.000)	 //vertex 5
	(142.645  0.000  0.000)	 //vertex 6
	(170.245  0.000  0.000)	 //vertex 7
	(202.489  0.000  0.000)	 //vertex 8
	(230.089  0.000  0.000)	 //vertex 9
	(248.489  0.000  0.000)	 //vertex 10
	(266.889  0.000  0.000)	 //vertex 11
	(294.489  0.000  0.000)	 //vertex 12
	(326.734  0.000  0.000)	 //vertex 13
	(354.334  0.000  0.000)	 //vertex 14
	(372.734  0.000  0.000)	 //vertex 15
	(391.134  0.000  0.000)	 //vertex 16
	(418.734  0.000  0.000)	 //vertex 17
	(450.978  0.000  0.000)	 //vertex 18
	(478.578  0.000  0.000)	 //vertex 19
	(496.978  0.000  0.000)	 //vertex 20
	(0.000  42.000  0.000)	 //vertex 21
	(18.400  42.000  0.000)	 //vertex 22
	(62.122  42.000  0.000)	 //vertex 23
	(105.845  42.000  0.000)	 //vertex 24
	(124.245  42.000  0.000)	 //vertex 25
	(142.645  42.000  0.000)	 //vertex 26
	(186.367  42.000  0.000)	 //vertex 27
	(230.089  42.000  0.000)	 //vertex 28
	(248.489  42.000  0.000)	 //vertex 29
	(266.889  42.000  0.000)	 //vertex 30
	(310.611  42.000  0.000)	 //vertex 31
	(354.334  42.000  0.000)	 //vertex 32
	(372.734  42.000  0.000)	 //vertex 33
	(391.134  42.000  0.000)	 //vertex 34
	(434.856  42.000  0.000)	 //vertex 35
	(478.578  42.000  0.000)	 //vertex 36
	(496.978  42.000  0.000)	 //vertex 37
	(0.000  200.000  0.000)	 //vertex 38
	(18.400  200.000  0.000)	 //vertex 39
	(62.122  200.000  0.000)	 //vertex 40
	(105.845  200.000  0.000)	 //vertex 41
	(124.245  200.000  0.000)	 //vertex 42
	(142.645  200.000  0.000)	 //vertex 43
	(186.367  200.000  0.000)	 //vertex 44
	(230.089  200.000  0.000)	 //vertex 45
	(248.489  200.000  0.000)	 //vertex 46
	(266.889  200.000  0.000)	 //vertex 47
	(310.611  200.000  0.000)	 //vertex 48
	(354.334  200.000  0.000)	 //vertex 49
	(372.734  200.000  0.000)	 //vertex 50
	(391.134  200.000  0.000)	 //vertex 51
	(434.856  200.000  0.000)	 //vertex 52
	(478.578  200.000  0.000)	 //vertex 53
	(496.978  200.000  0.000)	 //vertex 54
	(0.000  0.000  577.000)	 //vertex 55
	(18.400  0.000  577.000)	 //vertex 56
	(46.000  0.000  577.000)	 //vertex 57
	(78.245  0.000  577.000)	 //vertex 58
	(105.845  0.000  577.000)	 //vertex 59
	(124.245  0.000  577.000)	 //vertex 60
	(142.645  0.000  577.000)	 //vertex 61
	(170.245  0.000  577.000)	 //vertex 62
	(202.489  0.000  577.000)	 //vertex 63
	(230.089  0.000  577.000)	 //vertex 64
	(248.489  0.000  577.000)	 //vertex 65
	(266.889  0.000  577.000)	 //vertex 66
	(294.489  0.000  577.000)	 //vertex 67
	(326.734  0.000  577.000)	 //vertex 68
	(354.334  0.000  577.000)	 //vertex 69
	(372.734  0.000  577.000)	 //vertex 70
	(391.134  0.000  577.000)	 //vertex 71
	(418.734  0.000  577.000)	 //vertex 72
	(450.978  0.000  577.000)	 //vertex 73
	(478.578  0.000  577.000)	 //vertex 74
	(496.978  0.000  577.000)	 //vertex 75
	(0.000  42.000  577.000)	 //vertex 76
	(18.400  42.000  577.000)	 //vertex 77
	(62.122  42.000  577.000)	 //vertex 78
	(105.845  42.000  577.000)	 //vertex 79
	(124.245  42.000  577.000)	 //vertex 80
	(142.645  42.000  577.000)	 //vertex 81
	(186.367  42.000  577.000)	 //vertex 82
	(230.089  42.000  577.000)	 //vertex 83
	(248.489  42.000  577.000)	 //vertex 84
	(266.889  42.000  577.000)	 //vertex 85
	(310.611  42.000  577.000)	 //vertex 86
	(354.334  42.000  577.000)	 //vertex 87
	(372.734  42.000  577.000)	 //vertex 88
	(391.134  42.000  577.000)	 //vertex 89
	(434.856  42.000  577.000)	 //vertex 90
	(478.578  42.000  577.000)	 //vertex 91
	(496.978  42.000  577.000)	 //vertex 92
	(0.000  200.000  577.000)	 //vertex 93
	(18.400  200.000  577.000)	 //vertex 94
	(62.122  200.000  577.000)	 //vertex 95
	(105.845  200.000  577.000)	 //vertex 96
	(124.245  200.000  577.000)	 //vertex 97
	(142.645  200.000  577.000)	 //vertex 98
	(186.367  200.000  577.000)	 //vertex 99
	(230.089  200.000  577.000)	 //vertex 100
	(248.489  200.000  577.000)	 //vertex 101
	(266.889  200.000  577.000)	 //vertex 102
	(310.611  200.000  577.000)	 //vertex 103
	(354.334  200.000  577.000)	 //vertex 104
	(372.734  200.000  577.000)	 //vertex 105
	(391.134  200.000  577.000)	 //vertex 106
	(434.856  200.000  577.000)	 //vertex 107
	(478.578  200.000  577.000)	 //vertex 108
	(496.978  200.000  577.000)	 //vertex 109

	(-40.000  0.000  0.000)	 //(edge block) vertex 0
	(-40.000  42.000  0.000)	 //(edge block) vertex 1
	(-40.000  200.000  0.000)	 //(edge block) vertex 2
	(-40.000  0.000  577.000)	 //(edge block) vertex 3
	(-40.000  42.000  577.000)	 //(edge block) vertex 4
	(-40.000  200.000  577.000)	 //(edge block) vertex 5
	(536.978  0.000  0.000)	 //(edge block) vertex 6
	(536.978  42.000  0.000)	 //(edge block) vertex 7
	(536.978  200.000  0.000)	 //(edge block) vertex 8
	(536.978  0.000  577.000)	 //(edge block) vertex 9
	(536.978  42.000  577.000)	 //(edge block) vertex 10
	(536.978  200.000  577.000)	 //(edge block) vertex 11

);


blocks
(
	hex (0 1 22 21 55 56 77 76) 	($plateauX_nC $surfaceY_nC $systemZ_nC) 	simpleGrading (1 $b_grading_y $z_grading)      	//riblet 0, block 0
	hex (1 2 23 22 56 57 78 77) 	($ribletX_nC $surfaceY_nC $systemZ_nC) 	simpleGrading ($l_grading_x $b_grading_y $z_grading)      	//riblet 0, block 1
	hex (3 4 24 23 58 59 79 78) 	($ribletX_nC $surfaceY_nC $systemZ_nC) 	simpleGrading ($r_grading_x $b_grading_y $z_grading)      	//riblet 0, block 2
	hex (4 5 25 24 59 60 80 79) 	($plateauX_nC $surfaceY_nC $systemZ_nC) 	simpleGrading (1 $b_grading_y $z_grading)      	//riblet 0, block 3
	hex (21 22 39 38 76 77 94 93) 	($plateauX_nC $fluidY_nC $systemZ_nC) 	simpleGrading (1 $t_grading_y $z_grading)      	//riblet 0, block 4
	hex (22 23 40 39 77 78 95 94) 	($ribletX_nC $fluidY_nC $systemZ_nC) 	simpleGrading ($l_grading_x $t_grading_y $z_grading)      	//riblet 0, block 5
	hex (23 24 41 40 78 79 96 95) 	($ribletX_nC $fluidY_nC $systemZ_nC) 	simpleGrading ($r_grading_x $t_grading_y $z_grading)      	//riblet 0, block 6
	hex (24 25 42 41 79 80 97 96) 	($plateauX_nC $fluidY_nC $systemZ_nC) 	simpleGrading (1 $t_grading_y $z_grading)      	//riblet 0, block 7

	hex (5 6 26 25 60 61 81 80) 	($plateauX_nC $surfaceY_nC $systemZ_nC) 	simpleGrading (1 $b_grading_y $z_grading)      	//riblet 1, block 0
	hex (6 7 27 26 61 62 82 81) 	($ribletX_nC $surfaceY_nC $systemZ_nC) 	simpleGrading ($l_grading_x $b_grading_y $z_grading)      	//riblet 1, block 1
	hex (8 9 28 27 63 64 83 82) 	($ribletX_nC $surfaceY_nC $systemZ_nC) 	simpleGrading ($r_grading_x $b_grading_y $z_grading)      	//riblet 1, block 2
	hex (9 10 29 28 64 65 84 83) 	($plateauX_nC $surfaceY_nC $systemZ_nC) 	simpleGrading (1 $b_grading_y $z_grading)      	//riblet 1, block 3
	hex (25 26 43 42 80 81 98 97) 	($plateauX_nC $fluidY_nC $systemZ_nC) 	simpleGrading (1 $t_grading_y $z_grading)      	//riblet 1, block 4
	hex (26 27 44 43 81 82 99 98) 	($ribletX_nC $fluidY_nC $systemZ_nC) 	simpleGrading ($l_grading_x $t_grading_y $z_grading)      	//riblet 1, block 5
	hex (27 28 45 44 82 83 100 99) 	($ribletX_nC $fluidY_nC $systemZ_nC) 	simpleGrading ($r_grading_x $t_grading_y $z_grading)      	//riblet 1, block 6
	hex (28 29 46 45 83 84 101 100) 	($plateauX_nC $fluidY_nC $systemZ_nC) 	simpleGrading (1 $t_grading_y $z_grading)      	//riblet 1, block 7

	hex (10 11 30 29 65 66 85 84) 	($plateauX_nC $surfaceY_nC $systemZ_nC) 	simpleGrading (1 $b_grading_y $z_grading)      	//riblet 2, block 0
	hex (11 12 31 30 66 67 86 85) 	($ribletX_nC $surfaceY_nC $systemZ_nC) 	simpleGrading ($l_grading_x $b_grading_y $z_grading)      	//riblet 2, block 1
	hex (13 14 32 31 68 69 87 86) 	($ribletX_nC $surfaceY_nC $systemZ_nC) 	simpleGrading ($r_grading_x $b_grading_y $z_grading)      	//riblet 2, block 2
	hex (14 15 33 32 69 70 88 87) 	($plateauX_nC $surfaceY_nC $systemZ_nC) 	simpleGrading (1 $b_grading_y $z_grading)      	//riblet 2, block 3
	hex (29 30 47 46 84 85 102 101) 	($plateauX_nC $fluidY_nC $systemZ_nC) 	simpleGrading (1 $t_grading_y $z_grading)      	//riblet 2, block 4
	hex (30 31 48 47 85 86 103 102) 	($ribletX_nC $fluidY_nC $systemZ_nC) 	simpleGrading ($l_grading_x $t_grading_y $z_grading)      	//riblet 2, block 5
	hex (31 32 49 48 86 87 104 103) 	($ribletX_nC $fluidY_nC $systemZ_nC) 	simpleGrading ($r_grading_x $t_grading_y $z_grading)      	//riblet 2, block 6
	hex (32 33 50 49 87 88 105 104) 	($plateauX_nC $fluidY_nC $systemZ_nC) 	simpleGrading (1 $t_grading_y $z_grading)      	//riblet 2, block 7

	hex (15 16 34 33 70 71 89 88) 	($plateauX_nC $surfaceY_nC $systemZ_nC) 	simpleGrading (1 $b_grading_y $z_grading)      	//riblet 3, block 0
	hex (16 17 35 34 71 72 90 89) 	($ribletX_nC $surfaceY_nC $systemZ_nC) 	simpleGrading ($l_grading_x $b_grading_y $z_grading)      	//riblet 3, block 1
	hex (18 19 36 35 73 74 91 90) 	($ribletX_nC $surfaceY_nC $systemZ_nC) 	simpleGrading ($r_grading_x $b_grading_y $z_grading)      	//riblet 3, block 2
	hex (19 20 37 36 74 75 92 91) 	($plateauX_nC $surfaceY_nC $systemZ_nC) 	simpleGrading (1 $b_grading_y $z_grading)      	//riblet 3, block 3
	hex (33 34 51 50 88 89 106 105) 	($plateauX_nC $fluidY_nC $systemZ_nC) 	simpleGrading (1 $t_grading_y $z_grading)      	//riblet 3, block 4
	hex (34 35 52 51 89 90 107 106) 	($ribletX_nC $fluidY_nC $systemZ_nC) 	simpleGrading ($l_grading_x $t_grading_y $z_grading)      	//riblet 3, block 5
	hex (35 36 53 52 90 91 108 107) 	($ribletX_nC $fluidY_nC $systemZ_nC) 	simpleGrading ($r_grading_x $t_grading_y $z_grading)      	//riblet 3, block 6
	hex (36 37 54 53 91 92 109 108) 	($plateauX_nC $fluidY_nC $systemZ_nC) 	simpleGrading (1 $t_grading_y $z_grading)      	//riblet 3, block 7

	hex (110 0 21 111 113 55 76 114) 	($LBlockX_nC $surfaceY_nC $systemZ_nC) 	simpleGrading ($inlet_xGrading $b_grading_y 1)        	//LHS, block 0
	hex (111 21 38 112 114 76 93 115) 	($LBlockX_nC $fluidY_nC $systemZ_nC) 	simpleGrading ($inlet_xGrading $t_grading_y 1)        	//LHS, block 1
	hex (20 116 117 37 75 119 120 92) 	($RBlockX_nC $surfaceY_nC $systemZ_nC) 	simpleGrading ($outlet_xGrading $b_grading_y 1)        	//RHS, block 0
	hex (37 117 118 54 92 120 121 109) 	($RBlockX_nC $fluidY_nC $systemZ_nC) 	simpleGrading ($outlet_xGrading $t_grading_y 1)        	//RHS, block 1

);


edges();


boundary
(
	leftWall
	{
		type patch;
		faces
		(
		(110 111 114 113)
		(111 112 115 114)
		);
	}


	rightWall
	{
		type patch;
		faces
		(
		(116 119 120 117)
		(117 120 121 118)
		);
	}

	lowerWall
	{
		type wall;
		faces
		(
		(0 55 56 1)
		(1 56 57 2)
		(2 57 78 23)
		(23 78 58 3)
		(3 58 59 4)
		(4 59 60 5)
		(5 60 61 6)
		(6 61 62 7)
		(7 62 82 27)
		(27 82 63 8)
		(8 63 64 9)
		(9 64 65 10)
		(10 65 66 11)
		(11 66 67 12)
		(12 67 86 31)
		(31 86 68 13)
		(13 68 69 14)
		(14 69 70 15)
		(15 70 71 16)
		(16 71 72 17)
		(17 72 90 35)
		(35 90 73 18)
		(18 73 74 19)
		(19 74 75 20)
		(110 113 55 0)
		(20 75 119 116)
		);
	}

	upperWall
	{
		type patch;
		faces
		(
		(38 39 94 93)
		(39 40 95 94)
		(40 41 96 95)
		(41 42 97 96)
		(42 43 98 97)
		(43 44 99 98)
		(44 45 100 99)
		(45 46 101 100)
		(46 47 102 101)
		(47 48 103 102)
		(48 49 104 103)
		(49 50 105 104)
		(50 51 106 105)
		(51 52 107 106)
		(52 53 108 107)
		(53 54 109 108)
		(112 38 93 115)
		(54 118 121 109)
		);
	}

	frontWall
	{
		type patch;
		faces
		(
		(0 1 22 21)
		(1 2 23 22)
		(3 4 24 23)
		(4 5 25 24)
		(21 22 39 38)
		(22 23 40 39)
		(23 24 41 40)
		(24 25 42 41)
		(5 6 26 25)
		(6 7 27 26)
		(8 9 28 27)
		(9 10 29 28)
		(25 26 43 42)
		(26 27 44 43)
		(27 28 45 44)
		(28 29 46 45)
		(10 11 30 29)
		(11 12 31 30)
		(13 14 32 31)
		(14 15 33 32)
		(29 30 47 46)
		(30 31 48 47)
		(31 32 49 48)
		(32 33 50 49)
		(15 16 34 33)
		(16 17 35 34)
		(18 19 36 35)
		(19 20 37 36)
		(33 34 51 50)
		(34 35 52 51)
		(35 36 53 52)
		(36 37 54 53)
		(110 0 21 111)
		(111 21 38 112)
		(20 116 117 37)
		(37 117 118 54)
		);
	}

	backWall
	{
		type patch;
		faces
		(
		(56 55 76 77)
		(57 56 77 78)
		(59 58 78 79)
		(60 59 79 80)
		(77 76 93 94)
		(78 77 94 95)
		(79 78 95 96)
		(80 79 96 97)
		(61 60 80 81)
		(62 61 81 82)
		(64 63 82 83)
		(65 64 83 84)
		(81 80 97 98)
		(82 81 98 99)
		(83 82 99 100)
		(84 83 100 101)
		(66 65 84 85)
		(67 66 85 86)
		(69 68 86 87)
		(70 69 87 88)
		(85 84 101 102)
		(86 85 102 103)
		(87 86 103 104)
		(88 87 104 105)
		(71 70 88 89)
		(72 71 89 90)
		(74 73 90 91)
		(75 74 91 92)
		(89 88 105 106)
		(90 89 106 107)
		(91 90 107 108)
		(92 91 108 109)
		(113 55 76 114)
		(114 76 93 115)
		(75 119 120 92)
		(92 120 121 109)
		);
	}
);


mergePatchPairs();
